dependency-graph.mmd
---
config:
    flowchart:
        defaultRenderer: elk
---

flowchart LR

subgraph 0["src"]
1["index.ts"]
subgraph 2["core"]
subgraph 3["docker"]
4["monitor.ts"]
O["client.ts"]
10["scheduler.ts"]
11["store-host-stats.ts"]
13["store-container-stats.ts"]
end
subgraph 6["plugins"]
7["plugin-manager.ts"]
15["loader.ts"]
end
subgraph 9["utils"]
A["logger.ts"]
W["respone-handler.ts"]
Y["package-json.ts"]
14["calculations.ts"]
17["change-me-checker.ts"]
end
subgraph C["database"]
D["repository.ts"]
F["helper.ts"]
end
subgraph T["stacks"]
U["controller.ts"]
end
subgraph 19["trpc"]
1A["index.ts"]
1B["router.ts"]
subgraph 1C["procedures"]
1D["api-config.procedure.ts"]
1F["docker-manager.procedure.ts"]
1G["docker-stats.procedure.ts"]
1H["logs.procedure.ts"]
1I["stacks.procedure.ts"]
end
1E["trpc.ts"]
end
end
subgraph G["typings"]
H["database.ts"]
I["docker.ts"]
L["websocket.ts"]
N["plugin.ts"]
R["elysiajs.ts"]
V["docker-compose.ts"]
12["dockerode.ts"]
end
subgraph J["routes"]
K["live-logs.ts"]
S["stacks.ts"]
X["utils.ts"]
1J["api-config.ts"]
1K["docker-manager.ts"]
1L["docker-stats.ts"]
1M["docker-websocket.ts"]
1N["logs.ts"]
end
subgraph P["middleware"]
Q["auth.ts"]
end
end
5["bun"]
8["events"]
B["path"]
E["bun:sqlite"]
M["stream"]
Z["package.json"]
subgraph 16["fs"]
18["promises"]
end
1-->4
1-->Q
1-->K
1-->S
1-->X
1-->H
1-->D
1-->10
1-->15
1-->1A
1-->A
1-->1J
1-->1K
1-->1L
1-->1M
1-->1N
4-->7
4-->D
4-->O
4-->A
4-->I
4-->I
4-->5
7-->A
7-->I
7-->N
7-->8
A-->D
A-->K
A-->L
A-->B
D-->F
D-->A
D-->H
D-->I
D-->E
F-->A
K-->A
K-->L
L-->M
N-->I
O-->A
O-->I
Q-->D
Q-->A
Q-->H
Q-->R
S-->D
S-->U
S-->A
S-->W
U-->D
U-->A
U-->H
U-->V
W-->A
W-->R
X-->Y
X-->W
Y-->Z
10-->D
10-->11
10-->13
10-->A
10-->H
11-->D
11-->O
11-->A
11-->I
11-->12
13-->A
13-->D
13-->O
13-->14
15-->17
15-->A
15-->7
15-->16
15-->B
17-->A
17-->18
1A-->1B
1B-->1D
1B-->1F
1B-->1G
1B-->1H
1B-->1I
1B-->1E
1D-->1E
1D-->D
1D-->A
1D-->Y
1D-->H
1F-->1E
1F-->D
1F-->A
1F-->I
1G-->1E
1G-->D
1G-->O
1G-->14
1G-->A
1G-->I
1G-->12
1H-->1E
1H-->D
1H-->A
1I-->1E
1I-->D
1I-->U
1I-->A
1J-->D
1J-->7
1J-->A
1J-->Y
1J-->W
1J-->Q
1J-->H
1K-->D
1K-->A
1K-->W
1L-->D
1L-->O
1L-->14
1L-->A
1L-->W
1L-->I
1L-->12
1M-->D
1M-->O
1M-->14
1M-->A
1M-->W
1M-->M
1N-->D
1N-->A
